app/views/restaurants/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 10]]
---
<h3>Reviews:</h3>
<% @restaurant.reviews.each do |review| %>