app/controllers/restaurants_controller.rb

  def index
    @restaurants = Restaurant.limit(10)
---
SELECT  "restaurants".* FROM "restaurants" LIMIT 10