app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "address", "city", "state", "zipcode", "description", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @restaurant = Restaurant.new(restaurant_params)

    if @restaurant.save